Revit 2024 API
UpdaterId Methods
The UpdaterId type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAddInId
 AddInId of the UpdaterId
GetGUID
 GUID value of the UpdaterId
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
UpdaterId Class
Autodesk.Revit.DB Namespace